# Отчет по лабораторной работе № 8
## по курсу "Фундаментальная информатика"

Студент группы М8О-108Б-23 Лернер Феликс леонидович

Работа выполнена 

Преподаватель: каф. 806 Севастьянов Виктор Сергеевич

**1. Тема** : Системы программирования на языке Си

**2. Цель работы**: изучение текстовых режакторов и  программирования на Си, получение навыков подготовки текстов и отладки программ.

**3. Задание**: изучить и освоить возможности лабораторной СП по содержащейся в практикуме документации и другим источникам, в том числе основные этапы процесса компиляции и подготовки программ к выполнению
составить и отладить простейшую программу на Си в терминальном классе
изучить различные системы программирования на Си на других платформах: GNU, MS Visual Studio и др. на домашних компьютерах.

**4. Идея, метод, алгоритм решения задачи**:Для выполнения работы необходимо ознакомиться с документацией конкретной системы программирования на языке C.
Освоить основные этапы процесса компиляции и подготовки программы к выполнению.
Составить и отладить простейшую программу на языке C в терминальном классе.
Изучить различные системы программирования на языке C на других платформах.

**5. Сценарий Выполнения работы**: Открыть файл lab8.c в редакторе кода.Написать программу на языке C, выводящую сообщение "Hello, stranger!".
Сохранить изменения и закрыть редактор кода.
Компилировать программу с использованием компилятора GCC: gcc -std=c99 -Wall -pedantic lab8.c.
Проверить наличие созданного исполняемого файла a.out.
Запустить программу: ./a.out.
Зафиксировать успешное выполнение программы.

**6. Протокол:**

```
f_lerner@LAPTOP-L659LAFN:~/code/inf_labs/8$ code report.md
f_lerner@LAPTOP-L659LAFN:~/code/inf_labs/8$ ls
report.md
f_lerner@LAPTOP-L659LAFN:~/code/inf_labs/8$ vim lab8.c
f_lerner@LAPTOP-L659LAFN:~/code/inf_labs/8$ ls
lab8.c  report.md
f_lerner@LAPTOP-L659LAFN:~/code/inf_labs/8$ cat lab8.c 
/* Лабораторная работа 8, 
 * Студент М8О-108Б-23 Ф. Лернер */

#include <stdio.h>

int main() {
	printf("Hello, stranger!\n")
	return 0;
}
f_lerner@LAPTOP-L659LAFN:~/code/inf_labs/8$ gcc -std=c99 -Wall -pedantic lab8.c
lab8.c: In function ‘main’:
lab8.c:7:37: error: expected ‘;’ before ‘return’
    7 |         printf("Hello, stranger!\n")
      |                                     ^
      |                                     ;
    8 |         return 0;
      |         ~~~~~~                       
f_lerner@LAPTOP-L659LAFN:~/code/inf_labs/8$ vim lab8.c
f_lerner@LAPTOP-L659LAFN:~/code/inf_labs/8$ gcc -std=c99 -Wall -pedantic lab8.c
f_lerner@LAPTOP-L659LAFN:~/code/inf_labs/8$ ls
a.out  lab8.c  report.md
f_lerner@LAPTOP-L659LAFN:~/code/inf_labs/8$ ./a.out
Hello, stranger!
f_lerner@LAPTOP-L659LAFN:~/code/inf_labs/8$ 
```

**7. Замечания автора**: замечания отсутсвуют, все прекрасно

**8. Выводы**: Работа с задачей по программированию на языке C требует тщательного планирования, анализа и реализации. Важно учитывать особенности языка C, такие как управление памятью, указатели и работа с битами. Необходимо также уделять внимание оптимизации кода и его эффективности.

Программирование на языке C требует от разработчика глубокого понимания алгоритмов и структур данных, так как язык C предоставляет широкие возможности для их реализации. Важно также быть внимательным к деталям, так как даже небольшие ошибки могут привести к серьезным проблемам.

В целом, работа с задачей по программированию на языке C требует тщательного подхода, глубоких знаний языка и умения применять их в практических задачах.
